# -*- coding: utf-8 -*-
"""
Created on Thu Jul 21 09:42:06 2016

@author: QingLing
"""

import pandas as pd
from gensim import  corpora, models

inputfile = 'jay_cut.txt'
stoplist = 'stoplist.txt'

data = pd.read_csv(inputfile,encoding = 'utf-8', header =None)
stop = pd.read_csv(stoplist, encoding = 'utf-8', header = None, sep = 'tipdm',engine='python')
stop = [' ', '','☆','〖','〗','周杰伦','歌词', '作曲'] + list(stop[0])

data[1] = data[0].apply(lambda s: s.split(' ')) #定义一个分割函数，然后用apply广播
data[2] = data[1].apply(lambda x: [i for i in x if i not in stop]) #逐词判断是否停用词，思路同上


data_dict = corpora.Dictionary(data[2])
data_corpus = [data_dict.doc2bow(i) for i in data[2]]
data_lda = models.LdaModel(data_corpus, num_topics=3, id2word=data_dict)

for i in range(3):
    data_lda.show_topic(i) #输出每个主题
    
    
"""
data_lda.show_topic(0)

[('爱', 0.010808543637637712),
 ('知道', 0.0055620395045245475),
 ('一直', 0.0045807372094883161),
 ('笑', 0.0045672598208966091),
 ('写', 0.0043672031009478456),
 ('风', 0.0039457618226748257),
 ('雨', 0.0032928282089025006),
 ('只', 0.003222988029646566),
 ('半兽人', 0.0031927977352548941),
 ('想', 0.0029756373365764548)]
 
 '0.011*爱 + 0.006*知道 + 0.005*一直 + 0.005*笑 + 0.004*写 + 
 0.004*风 + 0.003*雨 + 0.003*只 + 0.003*半兽人 + 0.003*想'

data_lda.show_topic(1)

[('梦', 0.0057867768793121929),
 ('回忆', 0.0054878663674488926),
 ('却', 0.0052150658036909337),
 ('一个', 0.0050302507757025187),
 ('再', 0.004975272180235522),
 ('想', 0.0041831906488679427),
 ('做', 0.0037667668860734346),
 ('世界', 0.0034398069911654974),
 ('雨', 0.0034046324203899588),
 ('月光', 0.0033155474349778023)]
 
 '0.006*梦 + 0.005*回忆 + 0.005*却 + 0.005*一个 + 0.005*再 + 
 0.004*想 + 0.004*做 + 0.003*世界 + 0.003*雨 + 0.003*月光'

data_lda.show_topic(2)

[('想', 0.010607812525915807),
 ('时间', 0.0081449446703098331),
 ('眼泪', 0.0054483818321283137),
 ('回忆', 0.0050812369690816095),
 ('温柔', 0.0047554238590480913),
 ('忘记', 0.0046814028174722152),
 ('爱', 0.0043787560904111622),
 ('带走', 0.0037298808681549907),
 ('比较', 0.0037037756770516984),
 ('画面', 0.0036914990218224059)]
 
 '0.011*想 + 0.008*时间 + 0.005*眼泪 + 0.005*回忆 + 0.005*温柔 + 
 0.005*忘记 + 0.004*爱 + 0.004*带走 + 0.004*比较 + 0.004*画面'
"""